{
    "welcome" : "Welcome to Remote-Lawnmower-Ultra!\nThe purpose of this game is to function as a integration test of the Python-based library Taz.\nThis game is optimized for Travis-CI usage and is mainly played by Travis himself.\nOf course, you can play the game as well.\nBut be aware for sake of testing purposes all items/rooms must be called with a Capital letter (e.g take Item1, goto Room2).\nSo, if you want to get started right away just hit [1] and enter. If you want to quit the game just enter the 'quit game' command. Now have fun with 'Remote-Lawnmower-Ultra'",
    "invalid_command" : "Invalid command. Please type 1 to start the game, or 'quit game' to exit this program.",
    "game_start": "Game is about to start!",
    "starting_room": "Bedroom",
    "intro":"=======================================\n|       REMOTE-LAWNMOWER-ULTRA        |\n| (type help for a list of commands)  |\n=======================================\nTravis wakes up in the bedroom. He suddenly feels the urge to build a new lawn mower.\nFor this he needs to get some items. So he better gets started. He starts looking around,\nif there is anything in this room, which would be helpful to build a lawn mower.\nBut there is only a closet, an alarm clock and the bed in here.",
    "outro": "Alright! LET'S GET READY TO RUMBLE!\n=======================================\n|           CONGRATULATIONS           |\n=======================================\nCongratulations, you helped Travis find all the things he needed to build the Remote-Lawmower-Ultra 3000 (TM) and mow is long overdue lawn.\nUnfortunately, Travis was so thrilled by the Remote-Lawnmower-Ultra's power, that he completely forgot about the gnomes. He ran over them, while speeding up and down his lawn, so that one part of the lawn is now soaked in blood.\nToo bad!\nWell, the game is over now...There is nothing more to see\nHowever, if you are still reading this, you must be really bored. Anyway I like all to thank all the people in #pygame2 for their patience.\nEspecially William K. Manire, who taught me about the CodeCleaners-videos and the GitHub workflow. Well then...That's it...Good-Bye\n=======================================\n|              GAME OVER              |\n=======================================\n"
}
